[
  {
    "name": "First-contributions",
    "description": "This project aims to simplify and guide the way beginners make their first contribution. If you are looking to make your first contribution",
    "url": "https://github.com/firstcontributions/first-contributions",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "LinksHub",
    "description": "Yes! LinksHub is open-sourced. LinksHub aims to provide developers with access to a wide range of free resources and tools that they can use in their work.",
    "url": "https://github.com/rupali-codes/LinksHub",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "DevProfiles",
    "description": "DevProfiles is a platform for developers to easily share their profiles, spotlight your skills, and connect with fellow developers in the community.",
    "url": "https://github.com/oyepriyansh/DevProfiles",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "DevTweet",
    "description": "An open-source developer-focused web application for sharing thoughts and knowledge within the developer community.",
    "url": "https://github.com/oyepriyansh/DevTweet",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "Whisper",
    "description": "A Fun Application to have a random chat with people safely.",
    "url": "https://github.com/Dun-sin/Whisper",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "ProjectsHub",
    "description": "ProjectsHub Platform is your all-in-one destination for hackathons, coding contests, project inspiration, and freelancing tasks. Whether you're an aspiring developer, a seasoned coder, or just passionate about tech, you'll find something exciting here.",
    "url": "https://github.com/Ayushpanditmoto/projectshub",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "FindIssues",
    "description": "FindIssues aims to provide you access to the most recent created issues on github which is not assigned to anyone yet, with its advance search technique.",
    "url": "https://github.com/anand346/findissues",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "Muzical",
    "description": "Muzical is a platform that let's you enjoy watching youtube videos and songs in-sync with friends and family members. All you need to do is just join a channel and start enjoying.",
    "url": "https://github.com/anand346/muzical",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "Code-Magic",
    "description": "Code Generator - Easily Generate CSS and Tailwind code based on your choice and input.",
    "url": "https://github.com/Dun-sin/Code-Magic",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "ProjectsHut",
    "description": "Projectshut is an open source web app that enables users to freely publish their projects and create user profiles within the platform.",
    "url": "https://github.com/priyankarpal/ProjectsHut",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "Forem",
    "description": "Forem is open source software for building communities. Communities for your peers, customers, fanbases, families, friends, and any other time and space where people need to come together to be part of a collective",
    "url": "https://github.com/forem/forem",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "BioDrop",
    "description": "An Open Source alternative to LinkTree to showcase your projects, milestones, events, and content.",
    "url": "https://github.com/EddieHubCommunity/BioDrop",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "Milan",
    "description": "Milan is the place to connect users, charities, and NGOs thus connecting those who need help and need for a good cause.",
    "url": "https://github.com/IAmTamal/Milan",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "AsaKatsu",
    "description": "'AsaKatsu' is a Japanese term for waking up a little early to do something productive, aligned with a specific goal. With this philosophy in mind, this product helps you keep track of your goals' progress.",
    "url": "https://github.com/asakatsuOrg/AsaKatsuProject",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "Good Docs Project",
    "description": "Looking to gain tech writing experience? Join the Good Docs Project. In this open source project, you will learn best practices for creating templates and writing instructions when documenting open source software.",
    "url": "https://thegooddocsproject.dev/",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "Open Contributions Project",
    "description": "This project's mission is to teach company leaders what open source is and how their businesses can benefit from creating open source software.",
    "url": "https://github.com/OpenContributionsProject/opencontributionssite",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "Codecademy Docs",
    "description": "Looking for a way to gain experience in tech writing? Codecademy Docs offer developers and open source enthusiasts a hands-on opportunity to collaborate with other learners. Together, you’ll create free, useful resources for developers and tech community members of all experience levels.",
    "url": "https://www.codecademy.com/pages/contribute-docs",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "GSoC Organizations",
    "description": "A site that views and analyzed information on the organizations participating in Google Summer of Code, filtering them by various factors like years of participation, categories, etc.",
    "url": "https://www.gsocorganizations.dev/",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "ProjectMate",
    "description": "It's an open source platform where new maintainers can connect with experienced maintainers, and collaborate with a community of passionate contributors.",
    "url": "https://github.com/rohitdasu/projectmate",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "Zod",
    "description": "It is a TypeScript-first schema declaration and validation library to eliminate duplicative type declarations.",
    "url": "https://github.com/colinhacks/zod",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "Code Thesaurus",
    "description": "The Polyglot Developer Reference.Use this tool to compare language components from languages you know and don't know, or just use it as a language reference cheat sheet.",
    "url": "https://codethesaur.us/",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "Women-Led-Open-Source",
    "description": "A living resource unveiling trailblazing leaders, from women to transgender and nonbinary individuals, shaping open source.",
    "url": "https://github.com/amandamartin-dev/women-led-open-source",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "Rocket.Chat",
    "description": "Rocket.Chat is an open-source fully customizable communications platform developed in JavaScript for organizations with high standards of data protection.",
    "url": "https://github.com/RocketChat/Rocket.Chat",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "The Tor Project",
    "description": "The Tor Project is primarily responsible for maintaining software for the Tor anonymity network.",
    "url": "https://github.com/TheTorProject",
    "category": "open-source",
    "subcategory": "projects"
  },
  {
    "name": "Free Programming Books",
    "description": "Freely available programming books. We are a community that cares about education and open access to programming knowledge. Our main goal is to provide quality and free programming learning resources to everyone around the world. But we couldn't do it without your help!",
    "url": "https://github.com/EbookFoundation/free-programming-books",
    "category": "open-source",
    "subcategory": "projects"
  }
]

