[
  {
    "name": "Three JS",
    "description": "The world's most popular JavaScript framework for displaying 3D content on the web. With three.js, you no longer need a fancy gaming PC console or download a special application to display photorealistic 3D graphics. All you need is a smartphone and a web browser.",
    "url": "https://threejs.org/",
    "category": "frontend",
    "subcategory": "3d-libraries"
  },
  {
    "name": "Babylon JS",
    "description": "One of the world's leading WebGL-based graphics engines. From a new visual scene inspector, best-in-class physically-based rendering, countless performance optimizations, and much more, Babylon.js brings powerful, beautiful, simple, and open 3D to everyone on the web.",
    "url": "https://www.babylonjs.com/",
    "category": "frontend",
    "subcategory": "3d-libraries"
  },
  {
    "name": "A-Frame",
    "description": "An open-source web framework for building virtual reality (VR) experiences. It is based on top of HTML, making it simple to get started. But it is not just a 3D scene graph or a markup language; the core is a powerful entity-component framework that provides a declarative, extensible, and composable structure to three.js.",
    "url": "https://aframe.io/",
    "category": "frontend",
    "subcategory": "3d-libraries"
  },
  {
    "name": "PlayCanvas",
    "description": "The world's easiest to use WebGL Game Engine. It's free, it's open source and it's backed by amazing developer tools.",
    "url": "https://playcanvas.com/",
    "category": "frontend",
    "subcategory": "3d-libraries"
  },
  {
    "name": "Cannon JS",
    "description": "A physics engine for the web. It's written in JavaScript and runs in the browser. It's a great choice for building 3D games and simulations in the browser. It's open-source and free to use.",
    "url": "https://schteppe.github.io/cannon.js/",
    "category": "frontend",
    "subcategory": "3d-libraries"
  },
  {
    "name": "Oimo JS",
    "description": "A 3D physics engine for the web. It's written in JavaScript and runs in the browser. It's a great choice for building 3D games and simulations in the browser. It's open-source and free to use.",
    "url": "https://lo-th.github.io/Oimo.js/",
    "category": "frontend",
    "subcategory": "3d-libraries"
  },
  {
    "name": "Cesium JS",
    "description": "CesiumJS is an open-source JavaScript library for creating world-class 3D globes and maps with the best possible performance, precision, visual quality, and ease of use.",
    "url": "https://cesium.com/cesiumjs/",
    "category": "frontend",
    "subcategory": "3d-libraries"
  },
  {
    "name": "X3DOM",
    "description": "A framework for integrating and manipulating 3D content in an HTML5 context. It uses the W3C X3D standard and is open-source and free to use.",
    "url": "https://www.x3dom.org/",
    "category": "frontend",
    "subcategory": "3d-libraries"
  },
  {
    "name": "Verge3D",
    "description": "A powerful and intuitive toolkit that allows Blender, 3ds Max, or Maya users to create immersive web-based experiences. Verge3D can be used to build interactive animations, product configurators, engaging presentations of any kind, online stores, explainers, e-learning content, portfolios, and browser games.",
    "url": "https://www.soft8soft.com/verge3d/",
    "category": "frontend",
    "subcategory": "3d-libraries"
  },
  {
    "name": "P5 JS",
    "description": "A JavaScript library for creative coding, with a focus on making coding accessible and inclusive for artists, designers, educators, beginners, and anyone else! p5.js is free and open-source because we believe software, and the tools to learn it, should be accessible to everyone.",
    "url": "https://p5js.org/",
    "category": "frontend",
    "subcategory": "3d-libraries"
  }
]
