[
  {
    "id": "23",
    "name": "Lottie files",
    "description": {
      "en": "LottieFiles takes away the complexity from Motion Design. It lets you Create, Edit, Test, Collaborate and Ship a Lottie in the easiest way possible.",
      "es": "LottieFiles te quita la complejidad del Motion Design. Te permite Crear, Editar, Probar, Colaborar y Enviar un Lottie de la manera más fácil posible."
    },
    "url": "https://lottiefiles.com/",
    "category": "frontend",
    "subcategory": "animations"
  },
  {
    "id": "27",
    "name": "Cubic Bezier",
    "description": {
      "en": "A tool for visualisation and creation of cubic-bezier curves for animation in CSS",
      "es": "Una herramienta para la visualización y creación de curvas cúbicas para la animación en CSS"
    },
    "url": "https://cubic-bezier.com/",
    "category": "frontend",
    "subcategory": "animations"
  },
  {
    "id": "28",
    "name": "Framer Motion",
    "description": {
      "en": "Framer Motion is a production-ready motion library for React from Framer, It's simple yet powerful, allowing you to express complex user interactions with robust, semantic markup.",
      "es": "Framer Motion es una biblioteca de movimiento listo para producción para React de Framer, es simple pero potente, lo que le permite expresar interacciones complejas del usuario con un marcado robusto y semántico."
    },
    "url": "https://www.framer.com/motion/",
    "category": "frontend",
    "subcategory": "animations"
  },
  {
    "id": "40",
    "name": "Proton",
    "description": {
      "en": "A JavaScript particle based animation engine. Which provides you tones of animated elements.",
      "es": "Un motor de animación basado en partículas de JavaScript. Que te proporciona toneladas de elementos animados."
    },
    "url": "https://drawcall.github.io/Proton/",
    "category": "frontend",
    "subcategory": "animations"
  },
  {
    "id": "41",
    "name": "AutoAnimate",
    "description": {
      "en": "Add motion to your apps with a single line of code.",
      "es": "Agrega movimiento a tus aplicaciones con una sola línea de código."
    },
    "url": "https://auto-animate.formkit.com/",
    "category": "frontend",
    "subcategory": "animations"
  }
]
