[
  {
    "name": "Glaze",
    "description": "All in one resource to get free illustrations images for characters, backgrounds, avatars and more.",
    "url": "https://glazestock.com/",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "unDraw",
    "description": "unDraw is another excellent platform to get free illustration images with no color restrictions.",
    "url": "https://undraw.co/illustrations",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "DrawKit",
    "description": "This is a collection of fully customizable PSD illustrations. They are done in two styles, and are available to use in your next project.",
    "url": "https://drawkit.com/",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "ManyPixels",
    "description": "This site contains 2500+ pixel and royalty-free illustrations you can use to power up your designs.",
    "url": "https://www.manypixels.co/gallery/",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "Reshot",
    "description": "Free Icons & Illustrations designs with instant downloads and commercial licenses.",
    "url": "https://www.reshot.com/",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "StorySet",
    "description": "Awesome free customizable illustrations for your next project.",
    "url": "https://storyset.com/",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "Freepik",
    "description": "Freepik's goal is to offer the best high-quality content: illustrations, photos, icons, mockups, presentations templates, etc.",
    "url": "https://www.freepik.com/",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "Blush Design",
    "description": "Blush Design is a creative platform offering a diverse collection of customizable illustrations for designers, developers, and content creators. With an extensive library of vibrant artwork, users can effortlessly enhance their projects. The platform allows easy customization of colors, styles, and elements to suit individual needs, empowering creativity and enhancing visual communication.",
    "url": "https://blush.design/",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "UI Store Design",
    "description": "UI Store Design is a platform dedicated to providing a wide range of design resources for UI/UX professionals. It offers a curated collection of high-quality templates, icons, illustrations, and other assets to enhance the visual appeal and user experience of digital products with a focus on simplicity and efficiency.",
    "url": "https://www.uistore.design/",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "Skribbl",
    "description": "Enrich your creative projects and support free access to the art of education with the collection of hand-drawn illustrations.",
    "url": "https://weareskribbl.com/",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "Humaaans",
    "description": "Humaaans is a flexible illustration library that simplifies visual storytelling. With diverse customizable human figures, it offers a wide range of poses and clothing options for inclusive and unique illustrations. Create captivating visuals effortlessly for websites, presentations, and more. Customize, mix, and match vector illustrations to bring your stories to life.",
    "url": "https://humaaans.com/",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "Open Doodles",
    "description": "Open Doodles is a vibrant collection of freely-usable illustrations that add personality to any project. With diverse hand-drawn characters, objects, and backgrounds, Open Doodles sparks creativity for designers, developers, and content creators. Enhance websites, presentations, and social media with these charming doodles. Let your imagination flow with the expressive world of Open Doodles.",
    "url": "https://opendoodles.com/",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "Craftwork",
    "description": "This is a powerful toolkit for designers and developers, offering a wide range of UI components, icons, and illustrations with seamless customization and integration. It streamlines the design process, saving time and elevating project quality. Unleash your creativity with Craftwork's intuitive tools and resources.",
    "url": "https://craftwork.design/",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "Getillustrations",
    "description": "Access a vast collection of 16,149 creative web and app illustrations, available for download to enhance your websites, applications, and print projects. Stay inspired with weekly updates and enjoy the convenience of multiple formats with Figma, AI, XD, and Sketch.",
    "url": "https://www.getillustrations.com/",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "Free SVG illustrations",
    "description": "Free SVG illustrations are available for any idea you can imagine. You can change the primary and secondary colors of the illustrations to match your project's style guide. Download the illustrations in either PNG or SVG format. Premium illustrations are also available.",
    "url": "https://freesvgillustration.com/",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "Awesome Illustrations 4 Projects",
    "description": "Indulge in the enchanting world of over 250 illustrations sourced from 50+ carefully curated websites, especially sorted into four categories, and conveniently accompanied by quick previews.",
    "url": "https://github.com/Anmol-Baranwal/Awesome-Illustrations-4Projects",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "Pixeltrue",
    "description": "Get access to different, high-quality illustrations and animations that are free to use for personal and commercial use.",
    "url": "https://www.pixeltrue.com/free-illustrations",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "IconScout",
    "description": "Get millions of 3Ds, icons, illustrations, Lottie animations, and best-in-class search tools for your website, mobile app or project with the IconScout API.",
    "url": "https://iconscout.com/",
    "category": "frontend",
    "subcategory": "illustrations"
  },
  {
    "name": "Absurd",
    "description": "Get access to different types of illustrations that are free to use for personal and commercial use.",
    "url": "https://absurd.design/",
    "category": "frontend",
    "subcategory": "illustrations"
  }
]