[
  {
    "name": "LinkFree",
    "description": "An Open Source alternative to LinkTree to showcase your open-source-projects, milestones, events, and content.",
    "url": "https://github.com/EddieHubCommunity/LinkFree",
    "category": "open source",
    "subcategory": "open-source-projects"
  },
  {
    "name": "Milan",
    "description": "Milan is the place to connect users, charities, and NGOs thus connecting those who need help and need for a good cause.",
    "url": "https://github.com/IAmTamal/Milan",
    "category": "open source",
    "subcategory": "open-source-projects"
  },
  {
    "name": "AsaKatsu",
    "description": "'AsaKatsu' is a Japanese term for waking up a little early to do something productive, aligned with a specific goal. With this philosophy in mind, this product helps you keep track of your goals' progress.",
    "url": "https://github.com/asakatsuOrg/AsaKatsuProject",
    "category": "open source",
    "subcategory": "open-source-projects"
  },
  {
    "name": "Good Docs Project",
    "description": "Looking to gain tech writing experience? Join the Good Docs Project. In this open source project, you will learn best practices for creating templates and writing instructions when documenting open source software.",
    "url": "https://thegooddocsproject.dev/",
    "category": "open source",
    "subcategory": "open-source-projects"
  },
  {
    "name": "Open Contributions Project",
    "description": "This project's mission is to teach company leaders what open source is and how their businesses can benefit from creating open source software.",
    "url": "https://github.com/OpenContributionsProject/opencontributionssite",
    "category": "open source",
    "subcategory": "open-source-projects"
  },
  {
    "name": "Web-Resources-Project",
    "description": "The project aims to provide developers with a centralized platform to access a wide range of front-end tools and resources, making their development process more efficient and productive.",
    "url": "https://github.com/jayk-gupta/web-resources-project",
    "category": "open source",
    "subcategory": "open-source-projects"
  },
  {
    "name": "Codeacademy Docs",
    "description": "Looking for a way to gain experience in tech writing? Codecademy Docs offer developers and open source enthusiasts a hands-on opportunity to collaborate with other learners. Together, you’ll create free, useful resources for developers and tech community members of all experience levels.",
    "url": "https://www.codecademy.com/pages/contribute-docs",
    "category": "open source",
    "subcategory": "open-source-projects"
  },
  {
    "name": "GSoC Organizations",
    "description": "A site that views and analyzed information on the organizations participating in Google Summer of Code, filtering them by various factors like years of participation, categories, etc.",
    "url": "https://www.gsocorganizations.dev/",
    "category": "open source",
    "subcategory": "open-source-projects"
  },
  {
    "name": "ProjectMate",
    "description": "It's a open-source platform to connect with experienced maintainers, and collaborate with a community of passionate contributors.",
    "url": "https://github.com/rohitdasu/projectmate",
    "category": "open source",
    "subcategory": "open-source-projects"
  }
]