[
  {
    "name": "Google Developer Groups",
    "description": "It allows tech professionals to learn new skills in a variety of formats. Here, events, workshops, and meet-ups are organized virtually or in-person for people with similar interests in technology.",
    "url": "https://gdg.community.dev/",
    "category": "other",
    "subcategory": "communities"
  },
  {
    "name": "GitHub Campus Expert",
    "description": "It is a global community of student leaders who are passionate about technology and helping others learn about it. It provides students with the opportunity to develop their technical skills, network with peers, and give back to their communities.",
    "url": "https://education.github.com/experts",
    "category": "other",
    "subcategory": "communities"
  },
  {
    "name": "Microsoft Learn Student Ambassador Program",
    "description": "This program empowers students to become technology leaders in their communities. Ambassadors gain access to exclusive resources, mentorship, and networking opportunities while developing their skills and promoting Microsoft technologies. It's a unique platform for students to make a meaningful impact and shape the future of technology.",
    "url": "https://studentambassadors.microsoft.com/",
    "category": "other",
    "subcategory": "communities"
  },
  {
    "name": "Intel Student Ambassador Program",
    "description": "Focuses on providing leadership events to students from the college who are pursuing graduate or Ph.D. level studies in the field of HPC, data science, and artificial intelligence.",
    "url": "https://devmesh.intel.com/member-programs/intel-student-ambassador-program",
    "category": "other",
    "subcategory": "communities"
  },
  {
    "name": "AI Student Community",
    "description": "An online community where students from all across the country learn, share experiences, and leverage their knowledge to create AI-enabled social impact solutions along with inclusively spreading AI awareness.",
    "url": "https://aistudent.community/",
    "category": "other",
    "subcategory": "communities"
  },
  {
    "name": "Zuno Foundit Community",
    "description": "Your go-to place for internships & fresher jobs that are verified and pay well. Be a community leader.",
    "url": "https://t.me/zunobyfoundit",
    "category": "other",
    "subcategory": "communities"
  },
  {
    "name": "AWS Educate Cloud Ambassador Program",
    "description": "The AWS Educate Cloud Ambassador Program recognizes individuals for their innovation and contributions that prepare students for careers in the modern technology workforce.",
    "url": "https://aws.amazon.com/education/awseducate/",
    "category": "other",
    "subcategory": "communities"
  },
   {
    "name": "VMware vExpert Program",
    "description": "The VMware vExpert Program is VMware’s global evangelism and advocacy program initiative that awards individuals who have made significant community contributions to the VMware ecosystem.",
    "url": "https://vexpert.vmware.com/",
    "category": "other",
    "subcategory": "communities"
  },
  {
    "name": "Women Who Code",
    "description": "Women Who Code is a global non-profit organization dedicated to providing women and non-binary individuals from diverse backgrounds with the necessary tools and skills to thrive in the tech industry.",
    "url": "https://www.womenwhocode.com/communities/",
    "category": "other",
    "subcategory": "communities"
  }
]