[
  {
    "name": "Docsify",
    "description": "If you're looking for a static generator that makes it easier for you to create docs, you'll love Docsify. Unlike GitBook, it does not generate static HTML files. Instead, it loads and parses your Markdown files and displays them as a website.",
    "url": "https://docsify.js.org/#/",
    "category": "technical-writing",
    "subcategory": "technical-writing-tools"
  },
  {
    "name": "Hugo",
    "description": "If you're looking for a framework to help you build your documentation site quickly, check out Hugo. It allows you to output your content in multiple formats, including JSON or AMP as well as provides shortcodes to simplify your Markdown files.",
    "url": "https://gohugo.io/",
    "category": "technical-writing",
    "subcategory": "technical-writing-tools"
  },
  {
    "name": "Grammarly",
    "description": "Grammarly is a popular grammar and spell-checking tool that also provides suggestions for improving writing clarity and style. It can be used as a browser extension or standalone application.",
    "url": "https://www.grammarly.com/",
    "category": "technical-writing",
    "subcategory": "technical-writing-tools"
  },
  {
    "name": "Hemingway Editor",
    "description": "Hemingway Editor is a writing tool that focuses on improving the readability of your text. It highlights complex sentences, excessive adverbs, and passive voice to help you create clear and concise content.",
    "url": "https://hemingwayapp.com/",
    "category": "technical-writing",
    "subcategory": "technical-writing-tools"
  },
  {
    "name": "Docusaurus",
    "description": "If you need a static generator to help you build your product’s documentation site, Docusaurus is your tool! :) Not only does it provide you with fast-side client navigation that takes interactivity to new heights, but also out-of-the-box documentation features that can help make your site stand out from the others.",
    "url": "https://docusaurus.io/",
    "category": "technical-writing",
    "subcategory": "technical-writing-tools"
  }
]
