[
  {
    "name": "Firebase Authentication",
    "description": "This guide provides information on best practices and patterns when building applications using Firebase.",
    "url": "https://firebase.google.com/docs/auth/",
    "category": "backend",
    "subcategory": "authentication"
  },
  {
    "name": "NextAuth.js",
    "description": "NextAuth.js is a open-source authentication solution for Next.js applications. It is designed to support Next.js, Serverless, the latest Next.js 13 app router, and route handlers.",
    "url": "https://next-auth.js.org/",
    "category": "backend",
    "subcategory": "authentication"
  },
  {
    "name": "Appwrite Authentication",
    "description": "Appwrite authentication is a secure and convenient way to verify user identities and control access to applications, providing features like user registration, login, and password reset, ensuring that only authorized users can interact with the app's services.",
    "url": "https://appwrite.io/docs/authentication",
    "category": "backend",
    "subcategory": "authentication"
  },
  {
    "name": "Passport Authentication",
    "description": "Passport is authentication middleware for Node.js. Extremely flexible and modular, this tool can be unobtrusively dropped in to any Express-based web application. It also provides a comprehensive set of support authentication strategies for usernames, passwords, Facebook, Twitter, and more.",
    "url": "https://www.passportjs.org/",
    "category": "backend",
    "subcategory": "authentication"
  },
  {
    "name": "AWS Amplify Authentication",
    "description": "AWS Amplify Authentication is a fully managed service within AWS Amplify that offers easy-to-use and secure authentication capabilities for web and mobile applications. It supports various authentication methods, including social sign-in, multi-factor authentication, and user management, enabling developers to add user authentication and access control to their applications with minimal effort.",
    "url": "https://docs.amplify.aws/lib/auth/getting-started/",
    "category": "backend",
    "subcategory": "authentication"
  },
  {
    "name": "Clerk",
    "description": "Clerk is more than a `sign-in` box. With clerk, you can integrate complete user management UIs and APIs. Clerk is built for Reactm Nextjs and the modern web",
    "url": "https://clerk.com/",
    "category": "backend",
    "subcategory": "authentication"
  },
  {
    "name": "Kinde",
    "description": "We’ve made getting set up with Kinde as simple and easy as possible. Spend less time on building authentication, and spend more time on building your core product.",
    "url": "https://kinde.com/",
    "category": "backend",
    "subcategory": "authentication"
  },
  {
    "name": "Keycloak",
    "description": "Keycloak is an open-source identity and access management solution for simplifying user authentication and authorization in applications and services. Keycloak provides user federation, strong authentication, user management, fine-grained authorization, and more.",
    "url": "https://www.keycloak.org/",
    "category": "backend",
    "subcategory": "authentication"

  },
  {
    "name": "Auth0",
    "description": "Auth0 is a flexible, drop-in solution to add authentication and authorization services to your applications. Your team and organization can avoid the cost, time, and risk that comes with building your own solution to authenticate and authorize users.",
    "url": "https://auth0.com/",
    "category": "backend",
    "subcategory": "authentication"
  }
]
