[
  {
    "name": "PostgreSQL",
    "description": "PostgreSQL is a free, open-source relational database that handles structured data and a widely used database management system. ",
    "url": "https://www.postgresql.org/",
    "category": "backend",
    "subcategory": "database"
  },
  {
    "name": "MongoDB",
    "description": "MongoDB is a source cross-platform document-oriented NoSQL database program",
    "url": "https://www.mongodb.com/",
    "category": "backend",
    "subcategory": "database"
  },
  {
    "name": "Firebase",
    "description": "It is a set of backend cloud computing services and application development platforms provided by Google. It hosts databases, services, authentication, and integration for a variety of applications, including Android, iOS, JavaScript, Node.js, Java, Unity, PHP, and C++.",
    "url": "https://firebase.google.com/docs/database",
    "category": "backend",
    "subcategory": "database"
  },
  {
    "name": "Tigris",
    "description": "Tigris is an open source NoSQL transactional database and search platform",
    "url": "https://www.tigrisdata.com/",
    "category": "backend",
    "subcategory": "database"
  },
  {
    "name": "Supabase",
    "description": "Supabase is a powerful open-source platform that combines database and authentication services to simplify backend development for web and mobile applications.",
    "url": "https://supabase.com/",
    "category": "backend",
    "subcategory": "database"
  },
  {
    "name": "SurrealDB",
    "description": "SurrealDB.com is an innovative platform merging reality and imagination, offering a unique and immersive experience through its surreal database.",
    "url": "https://surrealdb.com/",
    "category": "backend",
    "subcategory": "database"
  },
  {
    "name": "MySQL",
    "description": "MySQL is an open-source relational database management system widely used for storing and retrieving structured data efficiently.",
    "url": "https://docs.oracle.com/en-us/iaas/mysql-database/doc/getting-started.html",
    "category": "backend",
    "subcategory": "database"
  },
  {
    "name": "Appwrite",
    "description": "Appwrite is an open-source backend server software that simplifies the development of web and mobile applications. It provides ready-to-use features like user authentication, database management, and file storage, allowing developers to focus on building their app's front-end functionality.",
    "url": "https://appwrite.io/docs",
    "category": "backend",
    "subcategory": "database"
  },
  {
    "name": "AWS Amplify",
    "description": "AWS Amplify is a comprehensive development platform offered by Amazon Web Services (AWS) that simplifies building scalable and secure web and mobile applications. It provides a set of tools, services, and libraries that enable developers to quickly create and deploy full-stack applications with seamless integration to various AWS services.",
    "url": "https://docs.aws.amazon.com/amplify/",
    "category": "backend",
    "subcategory": "database"
  },
  {
    "name": "Apache Cassandra",
    "description": "Apache Cassandra is a free and open-source, distributed, wide column store, NoSQL database management system designed to handle large amounts of data across many commodity servers, providing high availability with no single point of failure.",
    "url": "https://cassandra.apache.org/",
    "category": "backend",
    "subcategory": "database"
  },
  {
    "name": "GraphQL",
    "description": "GraphQL provides a comprehensive description of the data in your API, which gives clients the power to ask for exactly what they need and nothing more and make it easier to evolve APIs over time. It also enables powerful developer tools.",
    "url": "https://graphql.org/",
    "category": "backend",
    "subcategory": "database"
  },
  {
    "name": "MariaDB",
    "description": "MariaDB is a community-developed, commercially supported fork of the MySQL relational database management system, intended to remain free and open-source software under the GNU General Public License.",
    "url": "https://mariadb.org/",
    "category": "backend",
    "subcategory": "database"
  },
  {
    "name": "PlanetScale",
    "description": "PlanetScale is a MySQL-compatible server less database that brings you scale, performance, and reliability — without sacrificing developer experience. With PlanetScale, you get the power of horizontal sharding, non-blocking schema changes, and many more powerful database features without the pain of implementing them.",
    "url": "https://planetscale.com/",
    "category": "backend",
    "subcategory": "database"
  },
  {
    "name": "Neon DB",
    "description": "Neon is Serverless Postgres built for the cloud. It separates compute and storage to offer modern developer features such as autoscaling, branching, bottomless storage, and more.",
    "url": "https://neon.tech/",
    "category": "backend",
    "subcategory": "database"
  },
  {
    "name": "PouchDB",
    "description": "PouchDB is an open-source JavaScript database built for creating offline-first web and mobile applications. It enables applications to work both online and offline while seamlessly syncing data.",
    "url": "https://pouchdb.com/",
    "category": "backend",
    "subcategory": "database"
  },
  {
    "name": "RethinkDB",
    "description": "RethinkDB is an open-source, distributed NoSQL database designed for real-time web applications. It offers real-time data updates and dynamic querying capabilities.",
    "url": "https://rethinkdb.com/",
    "category": "backend",
    "subcategory": "database"
  },
  {
    "name": "Yugabyte DB",
    "description": "YugabyteDB is the 100% open source cloud native database for mission critical applications. YugabyteDB runs in any public or hybrid cloud.",
    "url": "https://www.yugabyte.com/",
    "category": "backend",
    "subcategory": "database"
  }
]
