[
  {
    "id": "66",
    "name": "GitHub Pages",
    "description": {
      "en": "A free hosting service provided by GitHub for hosting static websites from a GitHub repository. Simple to use but limited in customization options.",
      "es": "Un servicio de alojamiento gratuito proporcionado por GitHub para alojar sitios web estáticos desde un repositorio de GitHub. Sencillo de usar pero limitado en opciones de personalización."
    },
    "url": "https://pages.github.com/",
    "categoryEn": "resources",
    "categoryEs": "recursos",
    "subcategory_en": "hosting",
    "subcategory_es": "hosting"
  },
  {
    "id": "67",
    "name": "Vercel",
    "description": {
      "en": "A cloud platform for building and deploying web projects, including static websites. Known for its fast CDN and Git integration. Offers custom domains, environment variables, and free hosting.",
      "es": "Una plataforma en la nube para crear y desplegar proyectos web, incluidos sitios web estáticos. Conocido por su rápido CDN e integración con Git. Ofrece dominios personalizados, variables de entorno y alojamiento gratuito."
    },
    "url": "https://vercel.com/",
    "categoryEn": "resources",
    "categoryEs": "recursos",
    "subcategory_en": "hosting",
    "subcategory_es": "hosting"
  },
  {
    "id": "68",
    "name": "Netlify",
    "description": {
      "en": "A popular platform for deploying and managing web projects, including static websites. Offers easy setup and integration with popular front-end frameworks, as well as features such as continuous deployment, custom domains, SSL certificates, and free hosting.",
      "es": "Una plataforma popular para desplegar y administrar proyectos web, incluidos sitios web estáticos. Ofrece una configuración fácil e integración con marcos de interfaz de usuario populares, así como características como despliegue continuo, dominios personalizados, certificados SSL y alojamiento gratuito."
    },
    "url": "https://www.netlify.com/",
    "categoryEn": "resources",
    "categoryEs": "recursos",
    "subcategory_en": "hosting",
    "subcategory_es": "hosting"
  },
  {
    "id": "69",
    "name": "Heroku",
    "description": {
      "en": "A cloud platform for deploying static as well dynamic websites, supporting multiple programming languages. It offers convenient management and scaling options, but with a cost based on usage",
      "es": "Una plataforma en la nube para desplegar sitios web estáticos y dinámicos, que admite varios lenguajes de programación. Ofrece opciones de gestión y escalado convenientes, pero con un costo basado en el uso"
    },
    "url": "https://www.heroku.com/",
    "categoryEn": "resources",
    "categoryEs": "recursos",
    "subcategory_en": "hosting",
    "subcategory_es": "hosting"
  },
  {
    "id": "70",
    "name": "PythonAnywhere",
    "description": {
      "en": "A platform for hosting Python based web apps with a cloud-based development environment. Offers free hosting with limited options and paid plans for additional features.",
      "es": "Una plataforma para alojar aplicaciones web basadas en Python con un entorno de desarrollo basado en la nube. Ofrece alojamiento gratuito con opciones limitadas y planes de pago para funciones adicionales."
    },
    "url": "https://www.pythonanywhere.com/",
    "categoryEn": "resources",
    "categoryEs": "recursos",
    "subcategory_en": "hosting",
    "subcategory_es": "hosting"
  },
  {
    "id": "71",
    "name": "Render",
    "description": {
      "en": "A comprehensive solution for hosting web applications, both static and dynamic, with a simple and streamlined deployment process. It offers a range of plans, including a free option with limited resources, and paid plans with increased storage, bandwidth, and processing power.",
      "es": "Una solución completa para alojar aplicaciones web, tanto estáticas como dinámicas, con un proceso de despliegue simple y eficiente. Ofrece una gama de planes, incluido un plan gratuito con recursos limitados y planes de pago con mayor almacenamiento, ancho de banda y potencia de procesamiento."
    },
    "url": "https://www.render.com/",
    "categoryEn": "resources",
    "categoryEs": "recursos",
    "subcategory_en": "hosting",
    "subcategory_es": "hosting"
  },
  {
    "id": "72",
    "name": "Fly",
    "description": {
      "en": "Fly is a serverless hosting platform that charges only for actual usage and provides automatic scaling and high availability for web applications. It offers a free plan with limited resources and paid plans with more processing power, storage, and bandwidth.",
      "es": "Fly es una plataforma de alojamiento sin servidor que cobra solo por el uso real y proporciona escalado automático y alta disponibilidad para aplicaciones web. Ofrece un plan gratuito con recursos limitados y planes de pago con más potencia de procesamiento, almacenamiento y ancho de banda."
    },
    "url": "https://www.fly.io/",
    "categoryEn": "resources",
    "categoryEs": "recursos",
    "subcategory_en": "hosting",
    "subcategory_es": "hosting"
  }
]
