[
  {
    "name": "GitHub Pages",
    "description": "A free hosting service provided by GitHub for hosting static websites from a GitHub repository. Simple to use but limited in customization options.",
    "url": "https://pages.github.com/",
    "category": "resources",
    "subcategory": "hosting"
  },
  {
    "name": "Vercel",
    "description": "A cloud platform for building and deploying web projects, including static websites. Known for its fast CDN and Git integration. Offers custom domains, environment variables, and free hosting.",
    "url": "https://vercel.com/",
    "category": "resources",
    "subcategory": "hosting"
  },
  {
    "name": "Netlify",
    "description": "A popular platform for deploying and managing web projects, including static websites. Offers easy setup and integration with popular front-end frameworks, as well as features such as continuous deployment, custom domains, SSL certificates, and free hosting.",
    "url": "https://www.netlify.com/",
    "category": "resources",
    "subcategory": "hosting"
  },
  {
    "name": "Heroku",
    "description": "Heroku is a cloud platform for deploying static as well dynamic websites, supporting multiple programming languages. It offers convenient management and scaling options, but with a cost based on usage",
    "url": "https://www.heroku.com/",
    "category": "resources",
    "subcategory": "hosting"
  },
  {
    "name": "PythonAnywhere",
    "description": "A platform for hosting Python based web apps with a cloud-based development environment. Offers free hosting with limited options and paid plans for additional features.",
    "url": "https://www.pythonanywhere.com/",
    "category": "resources",
    "subcategory": "hosting"
  },
  {
    "name": "Render",
    "description": "Render is a comprehensive solution for hosting web applications, both static and dynamic, with a simple and streamlined deployment process. It offers a range of plans, including a free option with limited resources, and paid plans with increased storage, bandwidth, and processing power.",
    "url": "https://www.render.com/",
    "category": "resources",
    "subcategory": "hosting"
  },
  {
    "name": "Fly",
    "description": "Fly is a serverless hosting platform that charges only for actual usage and provides automatic scaling and high availability for web applications. It offers a free plan with limited resources and paid plans with more processing power, storage, and bandwidth.",
    "url": "https://www.fly.io/",
    "category": "resources",
    "subcategory": "hosting"
  },
  {
    "name": "Firebase Hosting",
    "description": "Firebase Hosting is a Google hosting service which provides fast and secure hosting for your web app, static and dynamic microservices. it is production-grade web content hosting for developers.",
    "url": "https://firebase.google.com/",
    "category": "resources",
    "subcategory": "hosting"
  },
  {
    "name": "000webhost",
    "description": "a hosting sevice provided by Hostinger, useful for quick testing purposes",
    "url": "https://www.000webhost.com/",
    "category": "resources",
    "subcategory": "hosting"
  },
  {
    "name": "Brimble",
    "description": "Brimble is your go-to cloud platform for effortlessly deploying frontend web applications, regardless of whether you're building a simple landing page or tackling a complex, large-scale project.",
    "url": "https://www.brimble.io/",
    "category": "resources",
    "subcategory": "hosting"
  }
]
